In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame(
    {"emp_id":[1,2,5,4],'Name': ["Alex","John","Abhishek","Watson"], 'Age': [25,30,24,20]})

In [3]:
df2=pd.DataFrame(    
    {"emp_id":[1,2,3,4],'Name': ["Alex","John","Krishna","Abhishek"], 'Weight': [60,65,70,75]})

In [4]:
df1

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [5]:
df2

   emp_id      Name  Weight
0       1      Alex      60
1       2      John      65
2       3   Krishna      70
3       4  Abhishek      75

In [6]:
pd.merge(df1,df2,how="inner")

   emp_id  Name  Age  Weight
0       1  Alex   25      60
1       2  John   30      65

In [7]:
pd.merge(df1,df2,how="inner",on=["emp_id"])

   emp_id  Name_x  Age    Name_y  Weight
0       1    Alex   25      Alex      60
1       2    John   30      John      65
2       4  Watson   20  Abhishek      75

In [8]:
pd.merge(df1,df2,how="outer")

   emp_id      Name   Age  Weight
0       1      Alex  25.0    60.0
1       2      John  30.0    65.0
2       5  Abhishek  24.0     NaN
3       4    Watson  20.0     NaN
4       3   Krishna   NaN    70.0
5       4  Abhishek   NaN    75.0

In [9]:
df1

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [10]:
df2

   emp_id      Name  Weight
0       1      Alex      60
1       2      John      65
2       3   Krishna      70
3       4  Abhishek      75

In [11]:
pd.merge(df1,df2,how="outer",on=["Name"])

   emp_id_x      Name   Age  emp_id_y  Weight
0       1.0      Alex  25.0       1.0    60.0
1       2.0      John  30.0       2.0    65.0
2       5.0  Abhishek  24.0       4.0    75.0
3       4.0    Watson  20.0       NaN     NaN
4       NaN   Krishna   NaN       3.0    70.0

# Left

In [13]:
df1

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [14]:
df2

   emp_id      Name  Weight
0       1      Alex      60
1       2      John      65
2       3   Krishna      70
3       4  Abhishek      75

In [12]:
pd.merge(df1,df2,how="left")

   emp_id      Name  Age  Weight
0       1      Alex   25    60.0
1       2      John   30    65.0
2       5  Abhishek   24     NaN
3       4    Watson   20     NaN

In [49]:
pd.merge(df1,df2,how="left",on=["Name"], suffixes=('_df1', '_df2'))

   emp_id_df1      Name  age  emp_id_df2  Weight
0           1      Alex   25         1.0    60.0
1           2      John   30         2.0    65.0
2           5  Abhishek   24         4.0    75.0
3           4    Watson   20         NaN     NaN

# right

In [17]:
df1

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [18]:
df2

   emp_id      Name  Weight
0       1      Alex      60
1       2      John      65
2       3   Krishna      70
3       4  Abhishek      75

In [16]:
pd.merge(df1,df2,how="right")

   emp_id      Name   Age  Weight
0       1      Alex  25.0      60
1       2      John  30.0      65
2       3   Krishna   NaN      70
3       4  Abhishek   NaN      75

In [22]:
pd.merge(df1,df2,how="right",on=["Name","emp_id"])

   emp_id      Name   Age  Weight
0       1      Alex  25.0      60
1       2      John  30.0      65
2       3   Krishna   NaN      70
3       4  Abhishek   NaN      75

# left_on and right_on

In [23]:
df1=pd.DataFrame(
    {"emp_id":[1,2,5,4],'Name_d1': ["Alex","John","Abhishek","Watson"], 'Age': [25,30,24,20]})

In [24]:
df2=pd.DataFrame(    
    {"emp_id":[1,2,3,4],'Name_d2': ["Alex","John","Krishna","Abhishek"], 'Weight': [60,65,70,75]})

In [25]:
df1

   emp_id   Name_d1  Age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [26]:
df2

   emp_id   Name_d2  Weight
0       1      Alex      60
1       2      John      65
2       3   Krishna      70
3       4  Abhishek      75

In [35]:
pd.merge(df1,df2,how="inner",left_on=["Name_d1","emp_id"],right_on=["Name_d2","emp_id"])

   emp_id Name_d1  Age Name_d2  Weight
0       1    Alex   25    Alex      60
1       2    John   30    John      65

In [45]:
df1.rename(columns={"Name_d1":"Name"},inplace=True)

In [46]:
df1

   emp_id      Name  age
0       1      Alex   25
1       2      John   30
2       5  Abhishek   24
3       4    Watson   20

In [41]:
df2.rename(columns={"Name_d2":"Name"},inplace=True)

In [44]:
pd.merge(df1,df2,how="inner")

   emp_id  Name  Age  Weight
0       1  Alex   25      60
1       2  John   30      65

# Concat

In [165]:
df1=pd.DataFrame(    
    {"emp_id":[1,2,3,5],'Name': ["Alex","John","Krishna","Abhishek"]})

In [166]:
df2=pd.DataFrame(    
    {"emp_id":[5,6],'Name': ["Krishna","Watson"], 'Age': [30,35]})

In [167]:
df1

   emp_id      Name
0       1      Alex
1       2      John
2       3   Krishna
3       5  Abhishek

In [168]:
df2

   emp_id     Name  Age
0       5  Krishna   30
1       6   Watson   35

In [169]:
dataset=pd.concat([df1,df2],axis=0)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [141]:
dataset

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       3   Krishna   40
3       5  Abhishek   45
0       5   Krishna   30
1       6    Watson   35

In [142]:
dataset.reset_index(inplace=True)

In [143]:
dataset.drop("index",axis=1,inplace=True)

In [144]:
dataset

   emp_id      Name  Age
0       1      Alex   25
1       2      John   30
2       3   Krishna   40
3       5  Abhishek   45
4       5   Krishna   30
5       6    Watson   35

In [145]:
dataset.set_index(["emp_id"],inplace=True)

In [149]:
dataset["Age"]

emp_id
1    25
2    30
3    40
5    45
5    30
6    35
Name: Age, dtype: int64

In [147]:
dataset.index

Int64Index([1, 2, 3, 5, 5, 6], dtype='int64', name='emp_id')

In [173]:
df1

   emp_id      Name
0       1      Alex
1       2      John
2       3   Krishna
3       5  Abhishek

In [174]:
df2

   emp_id     Name  Age
0       5  Krishna   30
1       6   Watson   35

In [182]:
pd.concat([df1,df2],axis=0,join="inner")

   emp_id      Name
0       1      Alex
1       2      John
2       3   Krishna
3       5  Abhishek
0       5   Krishna
1       6    Watson

In [180]:
pd.concat([df1,df2])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    Age      Name  emp_id
0   NaN      Alex       1
1   NaN      John       2
2   NaN   Krishna       3
3   NaN  Abhishek       5
0  30.0   Krishna       5
1  35.0    Watson       6